#+TITLE: syncthing-activity

This is a fork of [[https://github.com/jpmens/syncthing-activity][syncthing-activity]] by jpmens. The main difference between this
fork and the original is the support parse relevant information to a script.

This small program uses [[https://syncthing.net][Syncthing]]'s [[https://docs.syncthing.net/dev/rest.html][REST API]] to determine the changes to files
and directories occurring on the local instance of Syncthing. The relevant event
API are [[https://docs.syncthing.net/events/itemfinished.html][ItemFinished]] and [[https://docs.syncthing.net/events/itemstarted.html][ItemStarted]]. It also allows users to connect the API
results to external scripts. 

** Usage
The help dialog explains everything you need to know.
#+BEGIN_SRC shell :results output :exports results
  ./syncthing_activity.py -h
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
usage: syncthing_activity.py [-h] [--event [EVENT]] [--url URL] [--api API]
                             [--script [SCRIPT]]

syncthing-activity v1.1.2 --- Watch a Syncthing server.

optional arguments:
  -h, --help         show this help message and exit
  --event [EVENT]    Event API type. `ItemStarted' or `ItemFinished'.

Environments:
  Over-ride global environment variables.

  --url URL          Syncthing URL, defaults to http://localhost:8384. Using
                     the SYNCTHING_URL environment.
  --api API          Syncthing API key. Using the SYNCTHING_API environment.

Scripts:
  Run a script along the watcher.

  --script [SCRIPT]  Path to the script along with all the required arguments.
                     For example: post-processor.py positional_arg1 --option_1
                     option_arg_1
#+END_EXAMPLE

